#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.ec2.aws_route_table.public: Refreshing state... [id=rtb-0380319f8305597d5]
module.ec2.aws_security_group.serverless: Refreshing state... [id=sg-0126710289f84e496]
module.ec2.aws_subnet.c: Refreshing state... [id=subnet-07a6dbb4cdca5bfb2]
module.ec2.aws_internet_gateway.this: Refreshing state... [id=igw-073398afee993879f]
module.ec2.aws_route_table_association.public_b: Refreshing state... [id=rtbassoc-0246776aa0fb957f0]
module.ec2.aws_route_table_association.public_a: Refreshing state... [id=rtbassoc-05b62f5c67f3fde83]
module.ec2.aws_subnet.a: Refreshing state... [id=subnet-00b154791c77ee0aa]
module.ec2.aws_vpc.this: Refreshing state... [id=vpc-0b0a7e5d6edb12d8f]
module.apigateway.aws_api_gateway_rest_api.this: Refreshing state... [id=olvfkynw2j]
module.ec2.aws_subnet.b: Refreshing state... [id=subnet-0d47eb3cf66a97072]
module.ec2.aws_route.public: Refreshing state... [id=r-rtb-0380319f8305597d51080289494]
module.ec2.aws_db_subnet_group.serverless: Refreshing state... [id=terraform-2023040121253942010000000a]
module.ec2.aws_route_table_association.public_c: Refreshing state... [id=rtbassoc-0e3a30281a3b1215e]
module.ec2.aws_ssm_parameter.vpc: Refreshing state... [id=/terraform/ec2/vpc-id]
module.dynamodb.aws_dynamodb_table.booking: Refreshing state... [id=booking-dev]
module.sqs.aws_sqs_queue.payment_dead_letter: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/936237456072/dev-rental-storage-payment-dead-letter-queue]
module.sns.aws_sns_topic.user: Refreshing state... [id=arn:aws:sns:us-east-1:936237456072:dev-rental-storage-user-topic]
module.sns.aws_sns_topic.authentication: Refreshing state... [id=arn:aws:sns:us-east-1:936237456072:dev-rental-storage-authentication-topic]
module.iam.aws_iam_role.lambda: Refreshing state... [id=service-lambda-role]
module.sns.aws_sns_topic.space: Refreshing state... [id=arn:aws:sns:us-east-1:936237456072:dev-rental-storage-space-topic]
module.iam.aws_iam_policy.enable_log: Refreshing state... [id=arn:aws:iam::936237456072:policy/EnableLog]
module.identity.data.aws_caller_identity.current: Reading...
module.sns.aws_sns_topic.booking: Refreshing state... [id=arn:aws:sns:us-east-1:936237456072:dev-rental-storage-booking-topic]
module.sqs.aws_sqs_queue.booking_dead_letter: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/936237456072/dev-rental-storage-booking-dead-letter-queue]
module.kinesis.aws_kinesis_stream.event: Refreshing state... [id=arn:aws:kinesis:us-east-1:936237456072:stream/dev-EventStream]
module.sqs.aws_sqs_queue.user_dead_letter: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/936237456072/dev-rental-storage-user-dead-letter-queue]
module.sqs.aws_sqs_queue.space_dead_letter: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/936237456072/dev-rental-storage-space-dead-letter-queue]
module.iam.aws_iam_policy.enable_s3: Refreshing state... [id=arn:aws:iam::936237456072:policy/EnableS3]
module.iam.aws_iam_policy.enable_dynamodb: Refreshing state... [id=arn:aws:iam::936237456072:policy/EnableDynamoDB]
module.identity.data.aws_caller_identity.current: Read complete after 0s [id=936237456072]
module.sns.aws_sns_topic.payment: Refreshing state... [id=arn:aws:sns:us-east-1:936237456072:dev-rental-storage-payment-topic]
module.apigateway.aws_ssm_parameter.rest_api_id: Refreshing state... [id=/terraform/apigateway/rest-api-id]
module.apigateway.aws_api_gateway_resource.health: Refreshing state... [id=meulv5]
module.apigateway.aws_ssm_parameter.rest_api_root_resource_id: Refreshing state... [id=/terraform/apigateway/rest-api-root-resource-id]
module.sqs.aws_sqs_queue.payment: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/936237456072/dev-rental-storage-payment-queue]
module.dynamodb.aws_ssm_parameter.booking_table_name: Refreshing state... [id=/terraform/dynamodb/booking-table-name]
module.dynamodb.aws_ssm_parameter.booking_table_stream_arn: Refreshing state... [id=/terraform/dynamodb/booking-table-stream-arn]
module.iam.aws_iam_role_policy_attachment.enable_log: Refreshing state... [id=service-lambda-role-20230401212526528200000003]
module.iam.aws_ssm_parameter.lambda_role_arn: Refreshing state... [id=/terraform/iam/lambda-role-arn]
module.sqs.aws_sqs_queue.user: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/936237456072/dev-rental-storage-user-queue]
module.sqs.aws_sqs_queue.booking: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/936237456072/dev-rental-storage-booking-queue]
module.apigateway.aws_api_gateway_method.health_get: Refreshing state... [id=agm-olvfkynw2j-meulv5-GET]
module.iam.aws_iam_role_policy_attachment.enable_s3: Refreshing state... [id=service-lambda-role-20230401212526331700000002]
module.sqs.aws_sqs_queue.space: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/936237456072/dev-rental-storage-space-queue]
module.iam.aws_iam_role_policy_attachment.enable_dynamodb: Refreshing state... [id=service-lambda-role-20230401212526297300000001]
module.kinesis.aws_ssm_parameter.space_db_host: Refreshing state... [id=/terraform/kinesis/event-stream-arn]
module.iam.aws_iam_policy.enable_ssm: Refreshing state... [id=arn:aws:iam::936237456072:policy/EnableSSM]
module.s3.aws_s3_bucket.space_profile: Refreshing state... [id=dev-936237456072-space-profile]
module.iam.aws_iam_policy.enable_kinesis: Refreshing state... [id=arn:aws:iam::936237456072:policy/EnableKinesis]
module.iam.aws_iam_policy.enable_sns: Refreshing state... [id=arn:aws:iam::936237456072:policy/EnableSNS]
module.iam.aws_iam_policy.enable_sqs: Refreshing state... [id=arn:aws:iam::936237456072:policy/EnableSQS]
module.iam.aws_iam_policy.enable_dynamodb_stream: Refreshing state... [id=arn:aws:iam::936237456072:policy/EnableDynamoDBStream]
module.sqs.aws_sns_topic_subscription.booking: Refreshing state... [id=arn:aws:sns:us-east-1:936237456072:dev-rental-storage-user-topic:eb3701db-62fa-42e8-8ed1-a0505347891c]
module.apigateway.aws_api_gateway_integration.health: Refreshing state... [id=agi-olvfkynw2j-meulv5-GET]
module.sqs.aws_sqs_queue_policy.payment: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/936237456072/dev-rental-storage-payment-queue]
module.sqs.aws_sqs_queue_policy.booking: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/936237456072/dev-rental-storage-booking-queue]
module.sqs.aws_sqs_queue_policy.space: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/936237456072/dev-rental-storage-space-queue]
module.rds.aws_db_instance.space: Refreshing state... [id=dev-rental-storage-space-db]
module.rds.aws_db_instance.user: Refreshing state... [id=dev-rental-storage-user-db]
module.apigateway.aws_api_gateway_deployment.this: Refreshing state... [id=kjtlr4]
module.iam.aws_iam_role_policy_attachment.enable_kinesis: Refreshing state... [id=service-lambda-role-20230401212528460600000008]
module.iam.aws_iam_role_policy_attachment.enable_sns: Refreshing state... [id=service-lambda-role-20230401212528083800000005]
module.iam.aws_iam_role_policy_attachment.enable_ssm: Refreshing state... [id=service-lambda-role-20230401212528303300000007]
module.iam.aws_iam_role_policy_attachment.enable_sqs: Refreshing state... [id=service-lambda-role-20230401212528247700000006]
module.iam.aws_iam_role_policy_attachment.enable_dynamodb_stream: Refreshing state... [id=service-lambda-role-20230401212528033300000004]
module.apigateway.aws_api_gateway_stage.this: Refreshing state... [id=ags-olvfkynw2j-dev]
module.rds.aws_ssm_parameter.space_db_port: Refreshing state... [id=/terraform/rds/space-db-port]
module.rds.aws_ssm_parameter.space_db_name: Refreshing state... [id=/terraform/rds/space-db-name]
module.rds.aws_ssm_parameter.space_db_username: Refreshing state... [id=/terraform/rds/space-db-username]
module.rds.aws_ssm_parameter.space_db_host: Refreshing state... [id=/terraform/rds/space-db-host]
module.rds.aws_ssm_parameter.space_db_password: Refreshing state... [id=/terraform/rds/space-db-password]
module.rds.aws_ssm_parameter.user_db_port: Refreshing state... [id=/terraform/rds/user-db-port]
module.rds.aws_ssm_parameter.user_db_host: Refreshing state... [id=/terraform/rds/user-db-host]
module.rds.aws_ssm_parameter.user_db_password: Refreshing state... [id=/terraform/rds/user-db-password]
module.rds.aws_ssm_parameter.user_db_username: Refreshing state... [id=/terraform/rds/user-db-username]
module.rds.aws_ssm_parameter.user_db_name: Refreshing state... [id=/terraform/rds/user-db-name]
module.s3.aws_s3_bucket_acl.space_profile: Refreshing state... [id=dev-936237456072-space-profile,public-read-write]
module.s3.data.aws_iam_policy_document.space_profile: Reading...
module.s3.aws_s3_bucket_cors_configuration.space_profile: Refreshing state... [id=dev-936237456072-space-profile]
module.s3.data.aws_iam_policy_document.space_profile: Read complete after 0s [id=976920168]
module.s3.aws_s3_bucket_policy.space_profile: Refreshing state... [id=dev-936237456072-space-profile]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.apigateway.aws_api_gateway_stage.this will be updated in-place
  ~ resource "aws_api_gateway_stage" "this" {
      ~ deployment_id         = "d4dazh" -> "kjtlr4"
        id                    = "ags-olvfkynw2j-dev"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.ec2.aws_db_subnet_group.serverless will be destroyed
  # (because aws_db_subnet_group.serverless is not in configuration)
  - resource "aws_db_subnet_group" "serverless" {
      - arn                     = "arn:aws:rds:us-east-1:936237456072:subgrp:terraform-2023040121253942010000000a" -> null
      - description             = "RDS Subnet Group" -> null
      - id                      = "terraform-2023040121253942010000000a" -> null
      - name                    = "terraform-2023040121253942010000000a" -> null
      - name_prefix             = "terraform-" -> null
      - subnet_ids              = [
          - "subnet-00b154791c77ee0aa",
          - "subnet-07a6dbb4cdca5bfb2",
          - "subnet-0d47eb3cf66a97072",
        ] -> null
      - supported_network_types = [
          - "IPV4",
        ] -> null
      - tags                    = {
          - "Name" = "DBSubnetGroupServerless"
        } -> null
      - tags_all                = {
          - "Name" = "DBSubnetGroupServerless"
        } -> null
    }

  # module.ec2.aws_internet_gateway.this will be destroyed
  # (because aws_internet_gateway.this is not in configuration)
  - resource "aws_internet_gateway" "this" {
      - arn      = "arn:aws:ec2:us-east-1:936237456072:internet-gateway/igw-073398afee993879f" -> null
      - id       = "igw-073398afee993879f" -> null
      - owner_id = "936237456072" -> null
      - tags     = {
          - "Name" = "InternetGateway"
        } -> null
      - tags_all = {
          - "Name" = "InternetGateway"
        } -> null
      - vpc_id   = "vpc-0b0a7e5d6edb12d8f" -> null
    }

  # module.ec2.aws_route.public will be destroyed
  # (because aws_route.public is not in configuration)
  - resource "aws_route" "public" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - gateway_id             = "igw-073398afee993879f" -> null
      - id                     = "r-rtb-0380319f8305597d51080289494" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0380319f8305597d5" -> null
      - state                  = "active" -> null
    }

  # module.ec2.aws_route_table.public will be destroyed
  # (because aws_route_table.public is not in configuration)
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:us-east-1:936237456072:route-table/rtb-0380319f8305597d5" -> null
      - id               = "rtb-0380319f8305597d5" -> null
      - owner_id         = "936237456072" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-073398afee993879f"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "PublicRoute"
        } -> null
      - tags_all         = {
          - "Name" = "PublicRoute"
        } -> null
      - vpc_id           = "vpc-0b0a7e5d6edb12d8f" -> null
    }

  # module.ec2.aws_route_table_association.public_a will be destroyed
  # (because aws_route_table_association.public_a is not in configuration)
  - resource "aws_route_table_association" "public_a" {
      - id             = "rtbassoc-05b62f5c67f3fde83" -> null
      - route_table_id = "rtb-0380319f8305597d5" -> null
      - subnet_id      = "subnet-00b154791c77ee0aa" -> null
    }

  # module.ec2.aws_route_table_association.public_b will be destroyed
  # (because aws_route_table_association.public_b is not in configuration)
  - resource "aws_route_table_association" "public_b" {
      - id             = "rtbassoc-0246776aa0fb957f0" -> null
      - route_table_id = "rtb-0380319f8305597d5" -> null
      - subnet_id      = "subnet-0d47eb3cf66a97072" -> null
    }

  # module.ec2.aws_route_table_association.public_c will be destroyed
  # (because aws_route_table_association.public_c is not in configuration)
  - resource "aws_route_table_association" "public_c" {
      - id             = "rtbassoc-0e3a30281a3b1215e" -> null
      - route_table_id = "rtb-0380319f8305597d5" -> null
      - subnet_id      = "subnet-07a6dbb4cdca5bfb2" -> null
    }

  # module.ec2.aws_security_group.serverless will be destroyed
  # (because aws_security_group.serverless is not in configuration)
  - resource "aws_security_group" "serverless" {
      - arn                    = "arn:aws:ec2:us-east-1:936237456072:security-group/sg-0126710289f84e496" -> null
      - description            = "Security group for Serverless functions" -> null
      - egress                 = [] -> null
      - id                     = "sg-0126710289f84e496" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 65535
            },
        ] -> null
      - name                   = "terraform-20230401212537404800000009" -> null
      - name_prefix            = "terraform-" -> null
      - owner_id               = "936237456072" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "SecurityGroupServerless"
        } -> null
      - tags_all               = {
          - "Name" = "SecurityGroupServerless"
        } -> null
      - vpc_id                 = "vpc-0b0a7e5d6edb12d8f" -> null
    }

  # module.ec2.aws_ssm_parameter.vpc will be destroyed
  # (because aws_ssm_parameter.vpc is not in configuration)
  - resource "aws_ssm_parameter" "vpc" {
      - arn         = "arn:aws:ssm:us-east-1:936237456072:parameter/terraform/ec2/vpc-id" -> null
      - data_type   = "text" -> null
      - description = "VPC Id provided by terraform" -> null
      - id          = "/terraform/ec2/vpc-id" -> null
      - name        = "/terraform/ec2/vpc-id" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
      - tier        = "Standard" -> null
      - type        = "String" -> null
      - value       = (sensitive value) -> null
      - version     = 1 -> null
    }

  # module.ec2.aws_subnet.a will be destroyed
  # (because aws_subnet.a is not in configuration)
  - resource "aws_subnet" "a" {
      - arn                                            = "arn:aws:ec2:us-east-1:936237456072:subnet/subnet-00b154791c77ee0aa" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az1" -> null
      - cidr_block                                     = "10.0.0.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-00b154791c77ee0aa" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "936237456072" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "SubnetA"
        } -> null
      - tags_all                                       = {
          - "Name" = "SubnetA"
        } -> null
      - vpc_id                                         = "vpc-0b0a7e5d6edb12d8f" -> null
    }

  # module.ec2.aws_subnet.b will be destroyed
  # (because aws_subnet.b is not in configuration)
  - resource "aws_subnet" "b" {
      - arn                                            = "arn:aws:ec2:us-east-1:936237456072:subnet/subnet-0d47eb3cf66a97072" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az2" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0d47eb3cf66a97072" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "936237456072" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "SubnetB"
        } -> null
      - tags_all                                       = {
          - "Name" = "SubnetB"
        } -> null
      - vpc_id                                         = "vpc-0b0a7e5d6edb12d8f" -> null
    }

  # module.ec2.aws_subnet.c will be destroyed
  # (because aws_subnet.c is not in configuration)
  - resource "aws_subnet" "c" {
      - arn                                            = "arn:aws:ec2:us-east-1:936237456072:subnet/subnet-07a6dbb4cdca5bfb2" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1c" -> null
      - availability_zone_id                           = "use1-az4" -> null
      - cidr_block                                     = "10.0.2.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-07a6dbb4cdca5bfb2" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "936237456072" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "SubnetC"
        } -> null
      - tags_all                                       = {
          - "Name" = "SubnetC"
        } -> null
      - vpc_id                                         = "vpc-0b0a7e5d6edb12d8f" -> null
    }

  # module.ec2.aws_vpc.this will be destroyed
  # (because aws_vpc.this is not in configuration)
  - resource "aws_vpc" "this" {
      - arn                                  = "arn:aws:ec2:us-east-1:936237456072:vpc/vpc-0b0a7e5d6edb12d8f" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-030d93c928cfb3929" -> null
      - default_route_table_id               = "rtb-0e49913ce7d23cba0" -> null
      - default_security_group_id            = "sg-0bfdbf8ca9f2011b3" -> null
      - dhcp_options_id                      = "dopt-0695e612bdeb1ebd9" -> null
      - enable_classiclink                   = false -> null
      - enable_classiclink_dns_support       = false -> null
      - enable_dns_hostnames                 = true -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-0b0a7e5d6edb12d8f" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-0e49913ce7d23cba0" -> null
      - owner_id                             = "936237456072" -> null
      - tags                                 = {
          - "Name" = "VPC"
        } -> null
      - tags_all                             = {
          - "Name" = "VPC"
        } -> null
    }

  # module.rds.aws_db_instance.space will be updated in-place
  ~ resource "aws_db_instance" "space" {
      ~ db_subnet_group_name                  = "terraform-2023040121253942010000000a" -> (known after apply)
        id                                    = "dev-rental-storage-space-db"
        name                                  = "spaces"
        tags                                  = {}
      ~ vpc_security_group_ids                = [
          - "sg-0126710289f84e496",
        ] -> (known after apply)
        # (47 unchanged attributes hidden)
    }

  # module.rds.aws_db_instance.user will be updated in-place
  ~ resource "aws_db_instance" "user" {
      ~ db_subnet_group_name                  = "terraform-2023040121253942010000000a" -> (known after apply)
        id                                    = "dev-rental-storage-user-db"
        name                                  = "users"
        tags                                  = {}
      ~ vpc_security_group_ids                = [
          - "sg-0126710289f84e496",
        ] -> (known after apply)
        # (47 unchanged attributes hidden)
    }

  # module.vpc.aws_db_subnet_group.serverless will be created
  + resource "aws_db_subnet_group" "serverless" {
      + arn                     = (known after apply)
      + description             = "RDS Subnet Group"
      + id                      = (known after apply)
      + name                    = (known after apply)
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "DBSubnetGroupServerless"
        }
      + tags_all                = {
          + "Name" = "DBSubnetGroupServerless"
        }
    }

  # module.vpc.aws_elasticache_subnet_group.serverless will be created
  + resource "aws_elasticache_subnet_group" "serverless" {
      + arn         = (known after apply)
      + description = "Elasticache Subnet Group"
      + id          = (known after apply)
      + name        = "elasticache-subnet-group-serverless"
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Name" = "ElasticacheSubnetGroupServerless"
        }
      + tags_all    = {
          + "Name" = "ElasticacheSubnetGroupServerless"
        }
    }

  # module.vpc.aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "InternetGateway"
        }
      + tags_all = {
          + "Name" = "InternetGateway"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route.public will be created
  + resource "aws_route" "public" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.vpc.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "PublicRoute"
        }
      + tags_all         = {
          + "Name" = "PublicRoute"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_a will be created
  + resource "aws_route_table_association" "public_a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_b will be created
  + resource "aws_route_table_association" "public_b" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_c will be created
  + resource "aws_route_table_association" "public_c" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_security_group.any will be created
  + resource "aws_security_group" "any" {
      + arn                    = (known after apply)
      + description            = "Security group for Serverless functions"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 6379
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SecurityGroupServerless"
        }
      + tags_all               = {
          + "Name" = "SecurityGroupServerless"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_security_group.ec2 will be created
  + resource "aws_security_group" "ec2" {
      + arn                    = (known after apply)
      + description            = "Security group for EC2"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 6379
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_security_group.elasticache will be created
  + resource "aws_security_group" "elasticache" {
      + arn                    = (known after apply)
      + description            = "Security group for Elasticache"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 6379
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SecurityGroupElasticache"
        }
      + tags_all               = {
          + "Name" = "SecurityGroupElasticache"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_ssm_parameter.vpc will be created
  + resource "aws_ssm_parameter" "vpc" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "VPC Id provided by terraform"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/ec2/vpc-id"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.vpc.aws_subnet.a will be created
  + resource "aws_subnet" "a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "SubnetA"
        }
      + tags_all                                       = {
          + "Name" = "SubnetA"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.b will be created
  + resource "aws_subnet" "b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "SubnetB"
        }
      + tags_all                                       = {
          + "Name" = "SubnetB"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.c will be created
  + resource "aws_subnet" "c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "SubnetC"
        }
      + tags_all                                       = {
          + "Name" = "SubnetC"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "VPC"
        }
      + tags_all                             = {
          + "Name" = "VPC"
        }
    }

Plan: 16 to add, 3 to change, 13 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kokiebisu, Action: `pull_request`*